package ljavafx;

public class L4_JavaFX {
    /*
    Библиотеки UI  в жава
    были awt, swing (<-> Idea), поэтому свинг поддерживается
    но свинг еще и сложный
    Если хотим оформить интерфейс - можно через CSS
    есть FXML - это как HTML
    Button
    Color - аккуратно с импортом, надо убедиться, что
            это из ДжаваФХ, а не авт/свинг
    Msi - пишем на Java, еще можно FXML
    можно еще графически интерфейс строить, т.е. перетягивать кусочки в сцену
    но, возможно, будет не то, тк некоторые вещи, которые можно на жава
    там не сделтаь
    программу на жаваФХ можно вставлять в веб-браузер
    можно сделать какое-то приложение и вставить в другое?
    есть много компонентов: кнопочек, переключателей, слайдеров,
    в общем, всего, из чего состоит интерфейс
    можно стилизовать с помощью CSS
    кроме того, есть канвас
    такой же стиль рисования, как и на жаваскрипт
    чото про текстовое форатирование и что пользователь может что-то изменять
    ЖаваФХ - не нативный интерфейс
    нативный - когда все кнопочки и тд выглядят одинаково?
    хз, короче, у жавыФХ все самостоятельно, поэтому она выглядит непривычно, но везде одинаково
     */
}
